{"businessState": "PA", "businessCity": "rankin", "content": "I had a hankering for some fried fish tonight and the fish fry at Maximilian Kolbe was going to close before I got home on the bus, and I suggested to my wife and 12 year-old daughter that we try Emil's lounge as WQED's Rick Seback loved the place as did Andrew Zimmern when he visited for the Bizarre Foods America episode featuring Pittsburgh.  \n\nThe place is in Rankin - a rough around the edges town in the Mon Valley between Swissvale and Braddock.  Don't be put off at first - the outside doesn't have much decoration to speak of and looks like the sort of place that you might think twice about it.  A TGI Fridays it isn't... And thank god for that.\n\nThe place is well-kept but a little dated -  no fripperies here.  But we're not here for the Decor - we're here for some dinner.  \n\nThe menu is basic with reasonable prices.  The meats and seafood are high quality and everything is made to order.  Their stuffed cabbage is regarded as the best in  Pittsburgh.  I love stuffed cabbage but I just made a batch a couple of weeks ago and I'm cabbaged out.  Their Ruebens are   also killer (our waitress raved about them).  My wife and I both settled on fish sandwiches.  These are true Pittsburgh fish Sammiches - fresh fried fish in crispy breading, crammed between enormous pillows of soft, yet chewy and crispy Mancini's Italian bread.  No adornments - just a boatload of hot crispy fish.  Emil's uses thick cod fillets piled high rather than a thin fillet that needs to be broken up to fit in the bun.  Truly a great sandwich.  My daughter had the BLT - looked good and on good bread and they weren't skimpy with the bacon.\n\nThe service was very pleasant and friendly and the crowd was a great group of folks.  We all had fun with 4 other tables when my wife pulled up a Trivial Pursuit game on her iPhone and pretty much everyone joined in and had a good laugh.\n\nOverall, if you consider yourself a true Pittsburgher - you must visit this place.  It's one of the few places (Big Jim's in the Run is another) where the spirit of Pittsburgh is alive and hungry.  Please go.", "businessName": "Emil's Lounge"}